InformationRegisters/ИдентификаторыОбъектовДляФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыОбъектовДляФедеральныхМедрегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МоментВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделМедрегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:DocumentRef.УтверждениеШтатногоРасписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеШтатногоРасписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбразованиеФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыОбъектовДляФедеральныхМедрегистров/Forms/ВыборПодразделенияФРМО/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ИдентификаторПодразделенияИБ", ИдентификаторПодразделенияИБ);
	ПодразделенияФРМО = Неопределено;
	Если Параметры.Свойство("ПодразделенияФРМО", ПодразделенияФРМО) Тогда 
		Для Каждого ТекущееПодразделение Из ПодразделенияФРМО Цикл 
			НовоеПодразделение = Подразделения.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НовоеПодразделение, ТекущееПодразделение);
			НовоеПодразделение.ЭтоОтделениеИлиКабинет = Ложь;
			Для Каждого ЭлементСтруктурыПодразделения Из ТекущееПодразделение.СтруктураПодразделения Цикл 
				НовыйЭлементСтруктурыПодразделения = НовоеПодразделение.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НовыйЭлементСтруктурыПодразделения, ЭлементСтруктурыПодразделения);
				НовыйЭлементСтруктурыПодразделения.ЭтоОтделениеИлиКабинет = Истина;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОповеститьОВыбореПодразделения();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОповеститьОВыбореПодразделения()
	
	ТекущиеДанные = Элементы.Подразделения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПередаваемаяСтруктура = Новый Структура;
	ПередаваемаяСтруктура.Вставить("ИдентификаторПодразделенияИБ", ИдентификаторПодразделенияИБ);
	
	ДочерниеЭлементы = ТекущиеДанные.ПолучитьЭлементы();
	Если ДочерниеЭлементы.Количество()=0 Тогда
		РодительскийЭлемент = ТекущиеДанные.ПолучитьРодителя();
		Если РодительскийЭлемент<>Неопределено И ТекущиеДанные.ЭтоОтделениеИлиКабинет Тогда 
			ПередаваемаяСтруктура.Вставить("Наименование", РодительскийЭлемент.Наименование);
			ПередаваемаяСтруктура.Вставить("Идентификатор", РодительскийЭлемент.Идентификатор);
			ПередаваемаяСтруктура.Вставить("ДополнительноеНаименование", ТекущиеДанные.Наименование);
			ПередаваемаяСтруктура.Вставить("ДополнительныйИдентификатор", ТекущиеДанные.Идентификатор);
		Иначе 
			ПередаваемаяСтруктура.Вставить("Наименование", ТекущиеДанные.Наименование);
			ПередаваемаяСтруктура.Вставить("Идентификатор", ТекущиеДанные.Идентификатор);
			ПередаваемаяСтруктура.Вставить("ДополнительноеНаименование", "");
			ПередаваемаяСтруктура.Вставить("ДополнительныйИдентификатор", "");
		КонецЕсли;
	Иначе 
		ПередаваемаяСтруктура.Вставить("Наименование", ТекущиеДанные.Наименование);
		ПередаваемаяСтруктура.Вставить("Идентификатор", ТекущиеДанные.Идентификатор);
		ПередаваемаяСтруктура.Вставить("ДополнительноеНаименование", "");
		ПередаваемаяСтруктура.Вставить("ДополнительныйИдентификатор", "");
	КонецЕсли;
	
	Закрыть(ПередаваемаяСтруктура);
	
КонецПроцедуры
